DataProcessors/ЗагрузкаКонтрагентовИзExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКонтрагентовИзExcel</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиНаименование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиВида</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ГруппаФизЛиц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ГруппаЮрЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическийАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресEMail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дополнительно</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗагрузкаКонтрагентовИзExcel/Forms/ФормаЗагрузкиВзаиморасчетов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент И НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		АдресВХранилище = ЗаписатьДолгиВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресВХранилище <> Неопределено Тогда
		Структура = Новый Структура("АдресВХранилище", АдресВХранилище);
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
		
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK); 
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьДолгиВХранилище(УникальныйИдентификаторВладельца) 
		
	АдресВХранилище = Неопределено;	
	Если ПеренестиВДокумент Тогда
		
		ТаблицаДолговКВозврату = ТаблицаДолгов.Выгрузить().СкопироватьКолонки();
		Для каждого СтрокаТЗ из ТаблицаДолгов Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Контрагент) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТаблицаДолговКВозврату.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
		АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаДолговКВозврату, УникальныйИдентификаторВладельца);
		
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл";
	ДиалогВыбора.Фильтр = "Файл Excel (*.xlsx;*.xls)|*.xlsx;*.xls|Все файлы (*.*)|*.*";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект);
	ДиалогВыбора.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПутьКФайлу = Результат[0];
		
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеНаФорме()
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Путь к файлу""", , "Объект.ПутьКФайлу");
		Возврат Ложь;
	КонецЕсли;
	
	Если НомерКолонкиНаименование = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Номер колонки ""Контрагент""", , , "НомерКолонкиНаименование");
		Возврат Ложь;
	КонецЕсли;
	
	Если НомерКолонкиСумма = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Номер колонки ""Сумма""", , , "НомерКолонкиСумма");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
	
&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	Если НЕ ПроверитьЗаполнениеНаФорме() Тогда 
		Возврат;
	КонецЕсли;
	
	//подключаемся к Excel
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Объект.ПутьКФайлу);
		ПоказатьОповещениеПользователя("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
	
	Если ТаблицаДолгов.Количество() > 0 Тогда
		ПоказатьОповещениеПользователя("Таблица долгов очищена");
	КонецЕсли;
	ТаблицаДолгов.Очистить();
	
	Для н = НомерСтроки по КоличествоСтрок Цикл
		Наименование = Excel.Cells(н, НомерКолонкиНаименование).Value;
		Если НЕ ПустаяСтрока(Наименование) Тогда
			
			НоваяСтрока = ТаблицаДолгов.Добавить();
			
			Контрагент = НайтиКонтрагента(Наименование);
			
			НоваяСтрока.Контрагент = Контрагент;
			НоваяСтрока.КонтрагентИзФайла = Наименование;			
			
			Если НЕ НомерКолонкиДоговор = 0 Тогда 
				НоваяСтрока.ДоговорИзФайла = Excel.Cells(н, НомерКолонкиДоговор).Value;
				Если ЗначениеЗаполнено(Контрагент) Тогда
					НоваяСтрока.Договор = ПодобратьДоговор(Контрагент, НоваяСтрока.ДоговорИзФайла);
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(Контрагент) Тогда
					НоваяСтрока.Договор = ПодобратьДоговор(Контрагент, "");
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ НомерКолонкиВалюта = 0 Тогда 
				НоваяСтрока.ВалютаИзФайла = Excel.Cells(н, НомерКолонкиВалюта).Value;
				Если НЕ ПустаяСтрока(НоваяСтрока.ВалютаИзФайла) Тогда
					Валюта = ПодобратьВалюту(НоваяСтрока.ВалютаИзФайла);
					НоваяСтрока.Валюта = ?(Валюта.Пустая(), ВалютаУчета, Валюта);
				Иначе
					НоваяСтрока.Валюта = ВалютаУчета;
				КонецЕсли;
			Иначе
				НоваяСтрока.Валюта = ВалютаУчета;
			КонецЕсли;			
			
			Попытка
				НоваяСтрока.Сумма = Число(Excel.Cells(н, НомерКолонкиСумма).Value);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;  	
	
	//Закрыть Ексель после выполнения кода
	Excel.DisplayAlerts = 0; 
	Excel.Quit();
	Excel.DisplayAlerts = 1;
	
КонецПроцедуры

&НаСервере
Функция НайтиКонтрагента(Наименование)
	Возврат Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
КонецФункции

&НаСервере
Функция ПодобратьВалюту(СтрВалюта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код ПОДОБНО &СтрВалюта
	|	ИЛИ Валюты.Наименование ПОДОБНО &СтрВалюта";
	
	Запрос.УстановитьПараметр("СтрВалюта", СтрВалюта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Валюты.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПодобратьДоговор(Контрагент, СтрДоговор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|ГДЕ
	|	(Договоры.Владелец = &Контрагент
	|			ИЛИ Договоры.Наименование ПОДОБНО &СтрДоговор)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СтрДоговор", СтрДоговор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;		
	КонецЕсли;
	
	Возврат Контрагент.ОсновнойДоговор;
	
КонецФункции
